{
  "basics": {
    "name": "Rory Turnbull",
    "label": "Human interaction | Assistive Robotics | Medical device development",
    "picture": "",
    "email": "",
    "website": "https://eps.leeds.ac.uk/mechanical-engineering/staff/10308/rory-turnbull]",
    "summary": "Working across various fields has given me a multidisciplinary research approach. I have worked on projects including rehabilitation exoskeletons, biomechanics modelling, nuclear pipe inspection robot design, medical device characterisation, diagnostic equipment development and medical device regulation.   My current research builds on a research interest identified during my PhD in human interaction with the development of textile-based sensors. With application is the prevention of diabetic foot ulcers, assessing human-robot interaction and professional sports analysis.  Contact me on LinkedIn, Twitter @rpturnbull or email turnbullrp@gmail.com",
    "location": {
      "address": "",
      "postalCode": "LS1",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "rpturnbull",
        "url": "https://twitter.com/rpturnbull"
      }
    ]
  },
  "work": [
    {
      "company": "University of Leeds",
      "position": "Postdoctoral Research Fellow, Healthcare Mechatronics Laboratory, SockSESS",
      "website": "",
      "startDate": "2022-11-01",
      "summary": "Developing a textile-based sensing system for identifying pressure ulcer-producing conditions in diabetic patients. Helping drive the move from reactive healthcare to preventative healthcare to disrupt the cycle of chronic pressure ulcer development.",
      "highlights": []
    },
    {
      "company": "University of Leeds",
      "position": "Postdoctoral Research Fellow, NIHR Leeds In-Vitro Diagnostics Co-operative",
      "website": "",
      "startDate": "2022-08-01",
      "summary": "Development of a point-of-care in-vitro diagnostic device for identifying C.Dificile infection in healthcare settings. To simplify healthcare professional workflows, improve diagnostic tool accessibility and reduce the time to diagnosis, enabling improvements in patient experience, medical care outcomes and significant budgetary savings.",
      "highlights": [],
      "endDate": "2022-12-01"
    },
    {
      "company": "University of Leeds",
      "position": "Post-doctoral Research Fellow, Surgical Technologies Laboratory",
      "website": "",
      "startDate": "2022-02-01",
      "summary": "Collaborated with an industry partner to investigate a wound care medical device and assess its effects on shear force transfer to the skin. The development of magnetic sensing technologies.",
      "highlights": [],
      "endDate": "2022-07-01"
    },
    {
      "company": "University of Leeds",
      "position": "Post-doctoral Research Fellow, Real Robotics Laboratory, RAIN Hub",
      "website": "",
      "startDate": "2021-11-01",
      "summary": "Continued the mechanical and electrical development of the Pipe In-Bore Articulated Inspection Robot (PIBAIR) as part of the RAIN hub. Certified radiation worker.",
      "highlights": [],
      "endDate": "2022-07-01"
    },
    {
      "company": "Pharmi Med Ltd",
      "position": "Project Assistant",
      "website": "",
      "startDate": "2019-10-01",
      "summary": "Providing assistance in a range of areas including: EU medical device regulation; quality management systems; manufacturing planning; clinical evaluations; failure modes and affects analysis; and design and development planning.",
      "highlights": [],
      "endDate": "2021-02-01"
    },
    {
      "company": "Robotics at Leeds Post Graduate Network",
      "position": "Founder/Committee Member",
      "website": "",
      "startDate": "2017-11-01",
      "summary": "Founded in November 2017, the Robotics at Leeds PGR Network was established with the aim of bringing together postgraduate research students (PGRs) with a shared interest in Robotics from across the University of Leeds, which previously was not prevalent. Since Robotics is a large discipline, the goal of the network is to bring PGRs from multiple faculties together to discuss their research, share their knowledge and to practice skills, such as presenting their work, in a constructive environment. Through events, such as seminars, talks and networking, we hope to expose PGRs to new ways of thinking, and concepts they otherwise would not have come across, driving innovation in Robotics at the University of Leeds.",
      "highlights": []
    },
    {
      "company": "University of Leeds",
      "position": "Laboratory Assistant, Institute of Medical and Biomedical Engineering",
      "website": "",
      "startDate": "2017-11-01",
      "summary": "iMBE Laboratory Assistant. Help in the running of simulators for biomechanical and wear testing",
      "highlights": [],
      "endDate": "2019-09-01"
    },
    {
      "company": "University of Leeds",
      "position": "Postgraduate Researcher, Exoskeleton Laboratory, Institute of Design Robotics and Optimisation",
      "website": "",
      "startDate": "2017-10-01",
      "summary": "Postgraduate researcher investigating human-robot interaction in robotic assistive exoskeletons. Working on the development of a modular exoskeleton platform and sensing systems used to validate a biomechanically accurate simulation to assess interaction.",
      "highlights": [],
      "endDate": "2022-03-01"
    },
    {
      "company": "MatOrtho Ltd",
      "position": "Summer Intern",
      "website": "",
      "startDate": "2016-06-01",
      "summary": "Summer intern, completed a project investigating the feasibility of a new product with the aim of providing advice on how the company should move forward. This was done through completing a life cycle analysis of the product, to break down different factors affecting said device, creating predictions based on previous sales data and using these to determine the uptake of the device.",
      "highlights": [],
      "endDate": "2016-08-01"
    },
    {
      "company": "National MedTech Foundation",
      "position": "Founding Committee Member",
      "website": "",
      "startDate": "2015-08-01",
      "summary": "Selected to become part of the founding committee for the student arm of the HTCf. Pioneering work to create a multi-disciplinary environment within the student body at Leeds. To encourage innovation by identifying clinical problems and solving these through a collaboration of students from various schools within the university.  HTCf later became the Medtech Foundation",
      "highlights": [],
      "endDate": "2016-06-01"
    },
    {
      "company": "MatOrtho Ltd",
      "position": "Work Experience",
      "website": "",
      "startDate": "2015-06-01",
      "summary": "Using Solidworks CAD software to create and update detailed 3D models and engineering drawings of products so they met updated specifications. Using Magics STL editing software to prepare models as part of rapid prototyping using 3D printing.",
      "highlights": [],
      "endDate": "2015-06-01"
    },
    {
      "company": "University of Leeds",
      "position": "Medical Engineering Course Representative",
      "website": "",
      "startDate": "2014-09-01",
      "summary": "Conveying items of concern to the staff student forum to ensure the thoughts of the students on my course were heard with the aim of improving the structure and content of the course.",
      "highlights": [],
      "endDate": "2015-06-01"
    }
  ],
  "education": [
    {
      "institution": "University of Leeds",
      "area": "",
      "studyType": "Integrated Masters of Engineering (BEng and MEng)",
      "startDate": "2013-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2017-01-01"
    },
    {
      "institution": "Dean Close School",
      "area": "",
      "studyType": "",
      "startDate": "2007-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2012-01-01"
    }
  ],
  "skills": [
    {
      "name": "Microsoft Office",
      "level": "",
      "keywords": []
    },
    {
      "name": "Microsoft Word",
      "level": "",
      "keywords": []
    },
    {
      "name": "SolidWorks",
      "level": "",
      "keywords": []
    },
    {
      "name": "Photography",
      "level": "",
      "keywords": []
    },
    {
      "name": "PowerPoint",
      "level": "",
      "keywords": []
    },
    {
      "name": "Microsoft Excel",
      "level": "",
      "keywords": []
    },
    {
      "name": "Matlab",
      "level": "",
      "keywords": []
    },
    {
      "name": "Customer Service",
      "level": "",
      "keywords": []
    },
    {
      "name": "Communication",
      "level": "",
      "keywords": []
    },
    {
      "name": "Teamwork",
      "level": "",
      "keywords": []
    },
    {
      "name": "Self-management",
      "level": "",
      "keywords": []
    },
    {
      "name": "Organization Skills",
      "level": "",
      "keywords": []
    },
    {
      "name": "Critical Thinking",
      "level": "",
      "keywords": []
    },
    {
      "name": "3D Computer Aided Design (3D CAD)",
      "level": "",
      "keywords": []
    },
    {
      "name": "C++",
      "level": "",
      "keywords": []
    },
    {
      "name": "NI LabVIEW",
      "level": "",
      "keywords": []
    },
    {
      "name": "Visio",
      "level": "",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native or bilingual proficiency"
    }
  ]
}